# task 6
# Реализовать функцию int_func(), принимающую слова из маленьких латинских букв и
# возвращающую их же, но с прописной первой буквой.
# Например, print(int_func(‘text’)) -> Text.

# task 7
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделённых пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре.
# Нужно сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Используйте написанную ранее функцию int_func().


int_func = lambda word = input('Введите слова с маленьких лотинских букв: '): word.title()

print(int_func())
